Revit 2024 API
ParameterValue Members
The ParameterValue type exposes the following members.
Methods
Name | Description
Copy
 Makes an identical copy of the given parameter value.
Dispose
Releases all resources used by the ParameterValue
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Tests equality with another instance of the same class.
IsSameType
 Tests another instance is of the same value type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ParameterValue Class
Autodesk.Revit.DB Namespace